Revit 2027 API
PipePressureDropData.Roughness Property
 The roughness of the pipe. Units: (ft).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Roughness { get; }
Public ReadOnly Property Roughness As Double
	Get
public:
property double Roughness {
	double get ();
}
member Roughness : float with get
Property Value
Double
See Also
Reference
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace